{
  "backend": "tokenizers",
  "bos_token": "<s>",
  "cls_token": "<cls>",
  "do_lower_case": false,
  "eos_token": "</s>",
  "extra_special_tokens": [
    "<eop>",
    "<eod>"
  ],
  "is_local": false,
  "keep_accents": false,
  "mask_token": "<mask>",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<pad>",
  "remove_space": true,
  "sep_token": "<sep>",
  "tokenizer_class": "XLNetTokenizer",
  "unk_id": 0,
  "unk_token": "<unk>"
}
